---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.KeynoteOnLinkWithDifferentKeynoteFile
source: html/4af9d69a-533c-d7e0-90d9-665a00b9a033.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.KeynoteOnLinkWithDifferentKeynoteFile Property

The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

## Syntax (C#)
```csharp
public static FailureDefinitionId KeynoteOnLinkWithDifferentKeynoteFile { get; }
```